<a href="https://colab.research.google.com/github/sandeepsonu1986/Demo-1/blob/master/Insaid_Project_Raw.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Dependicies
# ! pip install mysql-connector-python

In [2]:
import pandas as pd
import mysql.connector

In [3]:
class CustomError(Exception):
    pass

In [5]:
def connect_to_mysql():

  # mysql_connect configurations
  host ='cpanel.insaid.co'
  user ='student'
  password ='student'
  database ='Capstone2'
  
  try:    
    return mysql.connector.connect(user=user, password=password, host=host, database=database)
  except mysql.connector.Error as err:
    print("Something went wrong in connect_to_mysql(): {}".format(err))

In [10]:
def get_data_from_database(sql):
  try: 
    data = pd.read_sql(sql, connect_to_mysql())
    if data.empty:
      raise CustomError
    
    return data
  except mysql.connector.Error as err:
    print("Something went wrong in get_data_from_database: {}".format(err))
  except CustomError:
    print("TABLE IS EMPTY!!")

In [11]:
# Fetch records from department_data
sql = sql = "SELECT * FROM department_data"
department_data = get_data_from_database(sql)

# Fetch records from Employee_data 
sql = "SELECT * FROM employee_data"
employee_data = get_data_from_database(sql)

# Fetch records from employee_details_data 
sql = "SELECT * FROM employee_details_data"
employee_details_data = get_data_from_database(sql)

# Fetch records from model_evaluation_results 
sql = "SELECT * FROM model_evaluation_results"
model_evaluation_results = get_data_from_database(sql)

# Fetch records from employee_details_data 
sql = "SELECT * FROM model_evaluation_table"
model_evaluation_table = get_data_from_database(sql)

In [12]:
# save tables to csv files
department_data.to_csv('department_data.csv')
employee_data.to_csv('employee_data.csv')
employee_details_data.to_csv('employee_details_data.csv')
model_evaluation_table.to_csv('model_evaluation_table.csv')
model_evaluation_results.to_csv('model_evaluation_results.csv')

In [13]:
department_data.head()

   dept_id    dept_name              dept_head
0   D00-IT           IT             Henry Adey
1   D00-SS        Sales        Edward J Bayley
2   D00-TP         Temp        Micheal Zachrey
3  D00-ENG  Engineering  Sushant Raghunathan K
4   D00-SP      Support         Amelia Westray

In [14]:
employee_data.head()

   avg_monthly_hrs department  filed_complaint  ...  status  tenure  employee_id
0            246.0       None              NaN  ...    Left     4.0       124467
1            134.0       None              NaN  ...    Left     3.0       112210
2            156.0     D00-SS              1.0  ...    Left     3.0       126150
3            256.0     D00-SP              NaN  ...    Left     4.0       125346
4            146.0     D00-SS              NaN  ...    Left     3.0       113707

[5 rows x 11 columns]

In [15]:
employee_details_data.head()

   employee_id  age  gender marital_status
0       113558   43    Male        Married
1       112256   24  Female      Unmarried
2       112586   22  Female      Unmarried
3       108071   36    Male        Married
4       116915   38    Male        Married

In [16]:
model_evaluation_results.head()

   group_id  threshold  accuracy_score  precision_score  recall  harmonic_mean
0      1000        0.5              56             0.37    0.63           0.47
1      1000        0.7              52             0.22    0.23           0.22
2      1003        0.5              96             0.96    0.90           0.93
3      1003        0.7              90             0.95    0.70           0.81
4      1001        0.5               7             0.08    0.20           0.11

In [17]:
model_evaluation_results.head()

   group_id  threshold  accuracy_score  precision_score  recall  harmonic_mean
0      1000        0.5              56             0.37    0.63           0.47
1      1000        0.7              52             0.22    0.23           0.22
2      1003        0.5              96             0.96    0.90           0.93
3      1003        0.7              90             0.95    0.70           0.81
4      1001        0.5               7             0.08    0.20           0.11